Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ལྟ་ཡང་ཞོག །ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏེ། དེ་དག་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་།
en: Kauśika, leaving aside their inducing the beings of Jambudvīpa toward unsurpassed, complete enlightenment, leaving aside their inducing the beings of the world system of the four continents toward unsurpassed, complete enlightenment, and likewise leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm, as many as there are—Kauśika, if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, were to induce all those beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, toward unsurpassed, complete enlightenment, and exhort them, saying, ‘Come here, noble child!

source: ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་། འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: ལྷོགས་ཤིག །ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་གྱིས་ཤིག །
en: You should earnestly apply yourself to the perfection of wisdom as it has been taught!

source: །རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་འགྱུར་རོ།
en: Noble child, when you train in the perfection of wisdom, at that time you will attain the attributes of all-aspect omniscience.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས།
en: Moreover, Kauśika, on the one hand if any noble sons or noble daughters, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་བས། དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་ཞིག་འདི་སྐད་དུ། བདག་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་ཟེར་ལ།
en: II-III: 120} having brought all the beings of Jambudvīpa, as many as there are, to irreversibility through unsurpassed, complete enlightenment, were to extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to those bodhisattva great beings, in accordance with its meaning and letters, presenting it in an authentic manner, so that among them a single bodhisattva great being could say, ‘I will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་པ་ལྟ་ཡང་ཞོག ། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །
en: while on the other hand if any noble sons or noble daughters were to extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to that one [alone], in accordance with its meaning and letters, presenting it in an authentic manner, then the merit of the latter would increase to an extent many times greater. “

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་པ་ལྟ་ཡང་ཞོག་ག །ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་གངྒའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་བས། དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་ཞིག་འདི་སྐད་དུ། བདག་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་ཟེར་ལ།
en: Kauśika, leaving aside their bringing of the beings of Jambudvīpa to irreversibility through unsurpassed, complete enlightenment, leaving aside their bringing of the beings of the world system of the four continents to irreversibility through unsurpassed, complete enlightenment, and likewise leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm, as many as there are—Kauśika, if on the one hand any noble sons or noble daughters, having brought all the beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, to irreversibility through unsurpassed, complete enlightenment, were to extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to those bodhisattva great beings, in accordance with its meaning and letters, presenting it in an authentic manner, so that among them a single bodhisattva great being could say, ‘I will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་ན། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: while on the other hand if any noble sons or noble daughters were to extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to that one [alone], in accordance with its meaning and letters, presenting it in an authentic manner, then the merit of the latter would increase manifold to a greater extent.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་ངེས་པ་སྟེ། རྫོགས་པའི་བྱང་ཆུབ་དུ་གཞོལ་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་མི་འགྱུར་བས་ན།
en: If you ask why, it is certain that those bodhisattva great beings who are irreversible will be immersed in perfect enlightenment and will progress irreversibly toward unsurpassed, complete enlightenment.

source: དེ་དག་ལ་ནི་དེ་ཙམ་དུ་ཆོས་བསྟན་ཀྱང་མི་དགོས་ཀྱི། འདི་ནི་འཁོར་བ་ནས་འབྱུང་བར་འདོད་ལ། སྙིང་རྗེ་ཆེན་པོས་མནར་བའི་ཕྱིར་རོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Consequently, even though they may not need the revelation of the Dharma to that extent, they seek to be emancipated from cyclic existence, but, on the other hand, are tormented by great compassion [for which reason they remain within it].”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Śakra then said to the Blessed One, “Blessed Lord, the more that bodhisattva great beings approach unsurpassed, complete enlightenment, the more that those bodhisattva great beings should be instructed and counseled in the perfection of generosity, and they should [likewise] be instructed and counseled in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །ནང་སྟོང་པ་ཉིད་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They should be instructed and counseled in the emptiness of internal phenomena, and they should be instructed and counseled in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They should be instructed and counseled in the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: They should be instructed and counseled in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ།
en: They should be instructed and counseled in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །གོས་དང་བསོད་སྙོམས་དང་མལ་ཆ་དང་ནད་ཀྱི་རྐྱེན་སྨན་དང་ཡོ་བྱད་ཀྱིས་ཀྱང་རྗེས་སུ་གཟུང་བར་བགྱི་སྟེ།
en: They should also be favored with food, alms, bedding, medications that cure ailments, and other useful resources.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ཆོས་ཀྱིས་བསྡུ་བ་དང་། ཟང་ཟིང་གིས་བསྡུ་བས་རྗེས་སུ་འཛིན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་གྱི།
en: The merit of noble sons or noble daughters who would favor those bodhisattva great beings, attracting them with the Dharma and attracting them with worldly needs, will increase manifold more so than that of the aforementioned noble sons or noble daughters. {

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སྔ་མ་དག་ནི་མ་ལགས་སོ།
en: Ki.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་ཡོད་ཡང་དེ་ལྟར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལགས་པ་དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པའོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པའོ།
en: II-III: 121} If one were to ask why, Blessed Lord, it is because those bodhisattva great beings will indeed be instructed and counseled in the perfections, and they will be instructed and counseled in all the aspects of emptiness, in the factors conducive to enlightenment, and in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པའོ།
en: They will be instructed and counseled in the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: They will be instructed and counseled in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མོས་པ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་འདོགས་པ་དང་ཡོངས་སུ་སྐྱོང་བ་ལེགས་སོ།
en: Then the venerable Subhūti said to Śakra, mighty lord of the gods, “Kauśika, you strengthen the resolve of bodhisattva great beings, you benefit bodhisattva great beings and nurture them.

source: ལེགས་སོ།
en: Well done!

source: །ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་དེ་བཞིན་དུ་བྱའོ།
en: Well done! Kauśika, you should act in that manner!

source: །འཕགས་པ་ཉན་ཐོས་གང་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པར་འདོད་པ་དེས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མོས་པ་བསྐྱེད་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཟང་ཟིང་དང་།
en: Noble śrāvakas who wish to benefit beings should also strengthen the resolve of bodhisattva great beings toward unsurpassed, complete enlightenment.

source: ཆོས་ཀྱིས་ཕན་གདགས་པས་ཕན་གདགས་ཤིང་ཡོངས་སུ་བསྐྱང་བར་བྱའོ།
en: They should benefit and nurture bodhisattvas by means of the Dharma and worldly needs.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལས་འབྱུང་ངོ་།
en: If you ask why, Kauśika, the saṅgha of the śrāvakas of the Blessed One originated from bodhisattva great beings. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་བསྐྱེད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་སློབ་པ་མ་ཡིན།
en: If bodhisattva great beings did not set their minds on unsurpassed, complete enlightenment, then bodhisattva great beings would not train in these six perfections.

source: ནང་སྟོང་པ་ཉིད་དང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སློབ་པ་མ་ཡིན་ཏེ།
en: They would not train in the emptiness of internal phenomena or in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, in the thirty-seven factors conducive to enlightenment, or in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་རོ།
en: They would not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ན། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་རྣམས་ཀྱང་ཡོད་པར་མི་འགྱུར་རོ།
en: If they did not attain consummate buddhahood in unsurpassed, complete enlightenment, there would even be no pratyekabuddhas, or śrāvakas. “

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་ཡང་སློབ་ལ། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་དང་འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་སློབ་པས། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: Kauśika, it is because bodhisattva great beings do train in these six perfections and it is because they do train in all the aspects of emptiness, in the thirty-seven factors conducive to enlightenment, and in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas that bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་དམྱལ་བ་རྣམས་རྒྱུན་ཆད་པར་འགྱུར་རོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་རྣམས་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: That is to say, they attain consummate buddhahood in unsurpassed, complete enlightenment and then in all world systems they cut off rebirth in the hells, and they cut off rebirth in the animal realm and the world of Yama.

source: །ལྷ་མ་ཡིན་གྱི་རིས་ཀྱང་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་རོ། །ལྷའི་རིས་ཀྱང་མངོན་པར་འཕེལ་བར་འགྱུར་རོ།
en: The realm of the asuras will also decrease, and the realm of the gods will manifestly increase.

source: །རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The members of great and lofty royal families will appear in the world, and the members of great and lofty priestly families and the members of great and lofty householder families will appear in the world.

source: །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The gods of the Caturmahā­rāja­kāyika realm will appear in the world.

source: །སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་དགའ་ལྡན་དང་འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The gods of Trayastriṃśa and the gods of the Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms will appear in the world.

source: །ཚངས་རིས་དང་ཚངས་ལྷ་ཉེ་ཕན་དང་།
en: The gods of Brahmakāyika, Brahma­pariṣadya, {Ki.

source: ཚངས་པ་ཀུན་འཁོར་དང་ཚངས་ཆེན་དང་སྣང་བ་དང་ཆུང་སྣང་དང་ཚད་མེད་སྣང་བ་དང་ཀུན་སྣང་དང་བ་དང་དགེ་བ་དང་ཆུང་དགེ་དང་ཚད་མེད་དགེ་བ་དང་དགེ་རྒྱས་དང་ཆེ་བ་དང་ཆུང་ཆེ་དང་ཚད་མེད་ཆེ་བ་དང་འབྲས་བུ་ཆེ་བ་དང་མི་ཆེ་བ་དང་མི་གདུང་བ་དང་ཤིན་དུ་མཐོང་བ་དང་གྱ་ནོམ་སྣང་བ་དང་འོག་མིན་གྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: II-III: 122} Brahmapurohita, Mahābrahmā Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha will appear in the world.

source: །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The gods of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception will appear in the world.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The perfection of generosity will appear in the world.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom will appear in the world.

source: །ནང་སྟོང་པ་ཉིད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The emptiness of internal phenomena will appear in the world, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, will appear in the world.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways will appear in the world.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas will appear in the world.

source: །ཉན་ཐོས་ཀྱི་ཐེག་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The vehicle of the śrāvakas will appear in the world.

source: །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The vehicle of the pratyekabuddhas will appear in the world.

source: །ཐེག་པ་ཆེན་པོ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The Great Vehicle will appear in the world.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། བརྒྱ་བྱིན་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་གསུམ་པའོ།། །།
en: This completes the twenty-third chapter, “Śakra,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས། གནས་བརྟན་རབ་འབྱོར་ལ་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་བྱ་བའི་དངོས་པོ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས།
en: Chapter 24: Dedication Then the bodhisattva great being Maitreya said to the venerable Subhūti, “Blessed Subhūti, there is a foundation of meritorious action, endowed with rejoicing, that bodhisattva great beings have—a foundation of meritorious action that they dedicate to unsurpassed, complete enlightenment, making common cause with all beings, without apprehending anything.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྡོ་བ་གང་ཡིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་བ་རྣམས་ཀྱི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གང་ཡིན་པ་དེ་དག་ལས།
en: Then there is a foundation of meritorious action, endowed with rejoicing, that all beings have; there is a foundation of meritorious action originating from the generosity of those who follow the vehicle of the śrāvakas and of those who follow the vehicle of the pratyekabuddhas; and there are also foundations of meritorious action originating from their ethical discipline and meditation.
